# вар 2.24
Из трехзначного числа x вычли его последнюю цифру. Когда результат разделили на 10, а к частному слева приписали последнюю цифру числаx, то получилось число 237. Найти число x. 
Оператор break используется для завершения циклического процесса (прерывание работы цикла).
Вывод: x=372
![image](https://user-images.githubusercontent.com/113889243/196457073-bec2cff7-78a2-40f6-aa93-be4a1d838cb2.png)
![image](https://user-images.githubusercontent.com/113889243/196457374-56aa2c98-96bb-49a1-bc03-4966a4306c9e.png)

